In [5]:
from IPython.display import display, HTML
import pandas as pd
import math

import plotly.graph_objects as go
import plotly.express as px
import numpy as np
from scipy import special

<h3> Read OrderDetails Data </h3>

In [6]:
# Read the w3schools Order Details data
df_ord_dt = pd.read_excel("Data/w3schools_Data.xlsx", "OrderDetails", skiprows=2)

print("Number of Rows:  ", df_ord_dt.shape[0])
print("Number of Columns:  ", df_ord_dt.shape[1])
df_ord_dt.head(3)

Number of Rows:   518
Number of Columns:   4

   OrderDetailID  OrderID  ProductID  Quantity
0              1    10248         11        12
1              2    10248         42        10
2              3    10248         72         5

In [7]:
df_ord_dt.dtypes

OrderDetailID    int64
OrderID          int64
ProductID        int64
Quantity         int64
dtype: object

<h3> Read Orders Data </h3>

In [8]:
# Read the w3schools Orders data
df_orders = pd.read_excel("Data/w3schools_Data.xlsx", "Orders")

print("Number of Rows:  ", df_orders.shape[0])
print("Number of Columns:  ", df_orders.shape[1])
df_orders.head(3)

Number of Rows:   196
Number of Columns:   5

   OrderID  CustomerID  EmployeeID  OrderDate  ShipperID
0    10248          90           5 1996-07-04          3
1    10249          81           6 1996-07-05          1
2    10250          34           4 1996-07-08          2

<h3>Join</h3>

In [9]:
df_ord_ord_dt = pd.merge(df_ord_dt, df_orders, on='OrderID', how='left')

print("Number of Rows:  ", df_ord_ord_dt.shape[0])
print("Number of Columns:  ", df_ord_ord_dt.shape[1])
df_ord_ord_dt.head(3)

Number of Rows:   518
Number of Columns:   8

,OrderDetailID,OrderID,ProductID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID
0,1,10248,11,12,90,5,1996-07-04,3
1,2,10248,42,10,90,5,1996-07-04,3
2,3,10248,72,5,90,5,1996-07-04,3

<h3> Read Products Data </h3>

In [10]:
# Read the w3schools Products data
df_prod = pd.read_excel("Data/w3schools_Data.xlsx", "Products", skiprows=2)

print("Number of Rows:  ", df_prod.shape[0])
print("Number of Columns:  ", df_prod.shape[1])
df_prod.head(3)

Number of Rows:   77
Number of Columns:   6

,ProductID,ProductName,SupplierID,CategoryID,Unit,Price
0,1,Chais,1,1,10 boxes x 20 bags,18.0
1,2,Chang,1,1,24 - 12 oz bottles,19.0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.0

<h3>Join</h3>

In [11]:
df_ord_prod_dt = pd.merge(df_ord_ord_dt, df_prod, on='ProductID', how='left')

print("Number of Rows:  ", df_ord_prod_dt.shape[0])
print("Number of Columns:  ", df_ord_prod_dt.shape[1])
df_ord_prod_dt.head(3)

Number of Rows:   518
Number of Columns:   13

,OrderDetailID,OrderID,ProductID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID,ProductName,SupplierID,CategoryID,Unit,Price
0,1,10248,11,12,90,5,1996-07-04,3,Queso Cabrales,5,4,1 kg pkg.,21.0
1,2,10248,42,10,90,5,1996-07-04,3,Singaporean Hokkien Fried Mee,20,5,32 - 1 kg pkgs.,14.0
2,3,10248,72,5,90,5,1996-07-04,3,Mozzarella di Giovanni,14,4,24 - 200 g pkgs.,34.8

<h3>Save Dataframe to <i>5.3_Part2.csv</i></h3>

In [12]:
df_ord_prod_dt.to_csv("Data/5.3_Part2.csv", index=False)

In [13]:
#Test

df_test = pd.read_csv("Data/5.3_Part2.csv")

print("Number of Rows:  ", df_test.shape[0])
print("Number of Columns:  ", df_test.shape[1])
df_test.head()

Number of Rows:   518
Number of Columns:   13

,OrderDetailID,OrderID,ProductID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID,ProductName,SupplierID,CategoryID,Unit,Price
0,1,10248,11,12,90,5,1996-07-04,3,Queso Cabrales,5,4,1 kg pkg.,21.00
1,2,10248,42,10,90,5,1996-07-04,3,Singaporean Hokkien Fried Mee,20,5,32 - 1 kg pkgs.,14.00
2,3,10248,72,5,90,5,1996-07-04,3,Mozzarella di Giovanni,14,4,24 - 200 g pkgs.,34.80
3,4,10249,14,9,81,6,1996-07-05,1,Tofu,6,7,40 - 100 g pkgs.,23.25
4,5,10249,51,40,81,6,1996-07-05,1,Manjimup Dried Apples,24,7,50 - 300 g pkgs.,53.00